In [1]:
import pandas as pd

# Task 3

In [2]:
path_game = '/Users/alina/Documents/Информатика/6sem/games.csv'
path_est = '/Users/alina/Documents/Информатика/6sem/estimations.csv'
data_game = pd.read_csv(path_game, sep=';')
data_est = pd.read_csv(path_est, sep=';')

In [3]:
data_game

   id             name           company
0   1           XCOM 2           Firaxis
1   2   Civilization V           Firaxis
2   3  Darkest Dungeon  Red Hook Studios
3   4     Star Traders    Trese Brothers

In [4]:
data_est.head()

   id  mark
0   1     8
1   1     9
2   1    10
3   1     9
4   1     8

In [5]:
data_top = data_est.groupby(by=['id'], as_index=False).mean().sort_values(by=['mark'], ascending=False).head(3)
data_top

   id      mark
2   3  9.000000
0   1  8.866667
1   2  8.333333

In [6]:
company = []
for i in data_top['id']:
    company.append(*data_game[data_game['id']==i]['company'].values)
    print(*data_game[data_game['id']==i]['name'].values, *data_top[data_top['id']==i]['mark'].values.round(3))
ind = 0
for j in company:
    if company.count(j) >= ind:
        ind = company.count(j)
        company_name = j
print(company_name, ind)

Darkest Dungeon 9.0
XCOM 2 8.867
Civilization V 8.333
Firaxis 2

# Task 4

In [7]:
path_papers = '/Users/alina/Documents/Информатика/6sem/papers.csv'
path_links = '/Users/alina/Documents/Информатика/6sem/links.csv'
data_papers = pd.read_csv(path_papers, sep=';')
data_links = pd.read_csv(path_links, sep=';')

In [8]:
data_papers

   id        title    author
0   1    Title One    Ivanov
1   2    Title Two   Sidorov
2   3  Title Three    Petrov
3   4   Title Four  A.N.Onim
4   5   Title Five    Petrov
5   6    Title Six    Petrov
6   7  Title Seven   Sidorov

In [9]:
data_links

   paper_id       reference
0         1       Title Two
1         1     Title Three
2         1  Something Else
3         1        Offtopic
4         2     Title Three
5         2      Title Four
6         2  One More Paper
7         3             Foo
8         4             Bar

In [10]:
data_new = pd.DataFrame({
    'referenced_papers': data_links['reference'].value_counts().index,
    'referenced_papers_counts': data_links['reference'].value_counts().values
})
data_new

  referenced_papers  referenced_papers_counts
0       Title Three                         2
1         Title Two                         1
2    Something Else                         1
3          Offtopic                         1
4        Title Four                         1
5    One More Paper                         1
6               Foo                         1
7               Bar                         1

In [11]:
data_merged = pd.DataFrame({
    'authors': data_papers['author'].value_counts().index,
    'author_papers_counts': data_papers['author'].value_counts().values
})
data_merged

    authors  author_papers_counts
0    Petrov                     3
1   Sidorov                     2
2    Ivanov                     1
3  A.N.Onim                     1

In [12]:
for i in data_papers['author']:
    count = 0
    for j in data_papers[data_papers['author']==i]['title'].values:
        if j not in data_new['referenced_papers'].values:
            count += 0
        else:
            count += data_new[data_new['referenced_papers']==j]['referenced_papers_counts'].values
        data_merged.loc[data_merged['authors']==i, 'citation'] = count / data_merged[
            data_merged['authors']==i]['author_papers_counts']

In [13]:
data_answer = data_merged.sort_values(by=['citation'], ascending=False).head(3)
data_answer

    authors  author_papers_counts  citation
3  A.N.Onim                     1  1.000000
0    Petrov                     3  0.666667
1   Sidorov                     2  0.500000

In [14]:
for i in data_answer['authors']:
    print(i, *data_answer[data_answer['authors'] == i]['citation'].values.round(3))

A.N.Onim 1.0
Petrov 0.667
Sidorov 0.5

# Task 1

In [15]:
import pandas as pd

n_m = list(map(int, input().split()))
n = n_m[0]
m = n_m[1]
ls = []
for _ in range(n):
    st = list(map(int, input().split()))
    ls += st

df = pd.DataFrame(ls)

print(df.loc[df[0] < -5].count().loc[0])
water = dict(df.loc[df[0] < 0].value_counts())
volume = 0
for key, value in water.items():
    volume -= key[0] * value
print(volume)
print(df[0].max())

4 6
1  4  4  2  1  1
0  0  1  0 -1 -1
-2 -3 -1 -5 -6 -4
-1 -3 -3 -4 -4 -2
1
40
4